{
  "backhanded_compliments": [
    "You're proof that even mistakes can be beautiful.",
    "You always manage to surprise me… for better or worse!",
    "You're so unique—there's truly no one else like you, and that's probably a good thing.",
    "You bring something special to the table... and we’re still trying to figure out what it is.",
    "You're better than nothing.",
    "You're like a software update: useful but always at the most inconvenient time.",
    "Your sense of humor is... definitely something.",
    "You have a lot of potential... hidden deep inside.",
    "You light up a room—especially when you leave.",
    "You're one-of-a-kind… just like everyone else.",
    "You’ve mastered the art of showing up late with confidence.",
    "You have such a talent for turning small problems into epic adventures.",
    "You’re living proof that perseverance is key, even if the results are... mixed.",
    "You're like a browser tab that won’t close—persistent and unforgettable.",
    "You have a real knack for finding the most creative solutions to problems no one else thought existed.",
    "Your fashion choices are truly bold and unapologetic.",
    "You’re not afraid to speak your mind… even when it might not be the best idea.",
    "You're a conversation starter—sometimes unintentionally.",
    "You’ve got the kind of personality that leaves a lasting impression.",
    "Your confidence is inspiring, even when it’s entirely misplaced.",
    "You’re a trailblazer—often going where no one asked you to go.",
    "You always know how to make an entrance… and a dramatic exit.",
    "Your timing is impeccable—especially when it’s awkward.",
    "You're a trendsetter in your own way… even if the trend hasn’t caught on yet.",
    "You’ve got charm, in an unconventional sort of way.",
    "Your dance moves are... brave.",
    "You always keep people guessing, which is both exciting and mildly terrifying.",
    "You’re like a rare gem—difficult to understand, but valuable in the right hands.",
    "You make people question everything… in a good way, probably.",
    "You're smarter than you look",
    "I wish I had your confidence",
    "You clean up surprisingly well",
    "You're not as bad as everyone says",
    "I love how you just wear anything",
    "You're so brave to try that hairstyle",
    "You could almost be a model... for stock photos",
    "You're really good at making simple things sound complicated",
    "I envy your ability to not care what others think",
    "You have such a unique perspective on everything"
  ]
}
